---
kind: method
id: M:Autodesk.Revit.DB.DocumentSet.Contains(Autodesk.Revit.DB.Document)
source: html/019bbde3-408a-d791-bb93-ce791ab7d37a.htm
---
# Autodesk.Revit.DB.DocumentSet.Contains Method

Tests for the existence of an item within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	Document item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Document`) - The item to be searched for.

## Returns
The Contains method returns True if the item is within the set, otherwise False.